In [3]:
import pandas as pd

In [4]:
lt = [range(1,21,2), range(2,21,2), range(10,101,10)]
df = pd.DataFrame(data=lt, columns=[f'co{idx}' for idx in range(1,11)])
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

### 첫 번째 행 추출

In [7]:
df.loc[0]
# df.iloc[0]

co1      1
co2      3
co3      5
co4      7
co5      9
co6     11
co7     13
co8     15
co9     17
co10    19
Name: 0, dtype: int64

### 마지막 행 추출
- loc는 라벨이라 인덱싱 불가능

In [10]:
# df.loc[2]
df.iloc[-1]

co1      10
co2      20
co3      30
co4      40
co5      50
co6      60
co7      70
co8      80
co9      90
co10    100
Name: 2, dtype: int64

### 첫 번째 ~ 두 번째 행 추출
- loc는 라벨이라 마지막값 포함
- iloc은 인덱스라 마지막값 포함 x

In [13]:
# df.loc[:1]
df.iloc[:2]

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20

### Series를 데이터 프레임으로 추출
- 행, 열을 대괄호로 한 번 더 묶어줌
- 같은 데이터라도 DataFrame이 Series보다 메모리를 더 많이 차지하기 때문에 꼭 DataFrame일 필요가 없다면 Series로 작업하는 것이 좋음

In [21]:
# df[['co2']]
# df.loc[:, ['co2']]
df.iloc[:, [1]]

   co2
0    3
1    4
2   20

### 상위 행 추출
- 문법 : DataFrame.head()

In [22]:
df.head(1)

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19

### 하위 행 추출
- 문법 : DataFrame.tail()

In [23]:
df.tail(1)

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
2   10   20   30   40   50   60   70   80   90   100